MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK60FX512VLQ12/mcu.h
#define OPCODE                        0x7FFF80000000      // Opcode Field In PAUSE Frames
#define PAUSE_DUR                     0x7FFF8000      // Pause Duration


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_IAUR register.
//
//*****************************************************************************

#define IADDR1                        0x7FFFFFFF80000000      // Contains the upper 32 bits of the 64-bit hash table used in the address recognition process for receive frames with a unicast address.


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_IALR register.
//
//*****************************************************************************

#define IADDR2                        0x7FFFFFFF80000000      // Contains the lower 32 bits of the 64-bit hash table used in the address recognition process for receive frames with a unicast address.


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_ATCR register.
//
//*****************************************************************************

#define SLAVE                         0x00002000      // Enable Timer Slave Mode
#define CAPTURE                       0x00000800      // Capture Timer Value
#define RESTART                       0x00000200      // Reset Timer
#define PINPER                        0x00000080      // Enables event signal output assertion on period event.
#define PEREN                         0x00000020      // Enable Periodical Event
#define OFFRST                        0x00000008      // Reset Timer On Offset Event
#define OFFEN                         0x00000004      // Enable One-Shot Offset Event
#define Reserved                      0x00000002      // This field is reserved.
#define EN                            0x00000001      // Enable Timer
#define PEREN                         0x00000010      // Enable Periodical Event


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_ATVR register.
//
//*****************************************************************************

#define ATIME                         0x7FFFFFFF80000000      // A write sets the timer. A read returns the last captured value.


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_ATOFF register.
//
//*****************************************************************************

#define OFFSET                        0x7FFFFFFF80000000      // Offset value for one-shot event generation.


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_ATPER register.
//
//*****************************************************************************

#define PERIOD                        0x7FFFFFFF80000000      // Value for generating periodic events.


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_ATCOR register.
//
//*****************************************************************************

#define Reserved                      0x7FFFC0000000      // This field is reserved.
#define COR                           0x0007E000      // Correction Counter Wrap-Around Value
#define Reserved                      0x00000080      // This field is reserved.
#define INC_CORR                      0x00001FC0      // Correction Increment Value
#define COR                           0x1FFFFFFFC0000000      // Correction Counter Wrap-Around Value


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_ATINC register.
//
//*****************************************************************************

#define Reserved                      0xFFFF80000000      // This field is reserved.
#define INC_CORR                      0x001FC000      // Correction Increment Value
#define Reserved                      0x00000080      // This field is reserved.
#define INC                           0x00001FC0      // Clock Period Of The Timestamping Clock (ts_clk) In Nanoseconds


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_ATSTMP register.
//
//*****************************************************************************

#define TIMESTAMP                     0x7FFFFFFF80000000      // Timestamp of the last frame transmitted by the core that had TxBD[TS] set .


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_TGSR register.
//
//*****************************************************************************

#define Reserved                      0x7FFFFFF80000000      // This field is reserved.
#define TF3                           0x00000008      // Copy Of Timer Flag For Channel 3
#define TF2                           0x00000004      // Copy Of Timer Flag For Channel 2
#define TF1                           0x00000002      // Copy Of Timer Flag For Channel 1
#define TF0                           0x00000001      // Copy Of Timer Flag For Channel 0
#define TF3-TF0                       0x00000078      // Copy Of Timer Flag For Channel 3-0


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_TCSRn register.
//
//*****************************************************************************

#define Reserved                      0x7FFFFF80000000      // This field is reserved.
#define TF                            0x00000080      // Timer Flag
#define TIE                           0x00000040      // Timer Interrupt Enable
#define TMODE                         0x000001E0      // Timer Mode
#define Reserved                      0x00000002      // This field is reserved.
#define TDRE                          0x00000001      // Timer DMA Request Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_TCCRn register.
//
//*****************************************************************************

#define TCC                           0x7FFFFFFF80000000      // Timer Capture Compare


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_GAUR register.
//
//*****************************************************************************

