MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK60FX512VLQ12/mcu.h
#define GADDR1                        0x7FFFFFFF80000000      // Contains the upper 32 bits of the 64-bit hash table used in the address recognition process for receive frames with a multicast address. Bit 31 of GADDR1 contains hash index bit 63. Bit 0 of GADDR1 contains hash index bit 32.


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_GALR register.
//
//*****************************************************************************

#define GADDR2                        0x7FFFFFFF80000000      // Contains the lower 32 bits of the 64-bit hash table used in the address recognition process for receive frames with a multicast address. Bit 31 of GADDR2 contains hash index bit 31. Bit 0 of GADDR2 contains hash index bit 0.


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_TFWR register.
//
//*****************************************************************************

#define STRFWD                        0x00000100      // Store And Forward Enable
#define TFWR                          0x000007E0      // Transmit FIFO Write


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_RDSR register.
//
//*****************************************************************************

#define R_DES_START                   0xFFFFFFF80000000      // Pointer to the beginning of the receive buffer descriptor queue.


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_TDSR register.
//
//*****************************************************************************

#define X_DES_START                   0xFFFFFFF80000000      // Pointer to the beginning of the transmit buffer descriptor queue.


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_MRBR register.
//
//*****************************************************************************

#define R_BUF_SIZE                    0x0001FC00      // Receive buffer size in bytes.


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_RSFL register.
//
//*****************************************************************************

#define RX_SECTION_FULL               0x00007F80      // Value, in 64-bit words, of the receive FIFO section full threshold. Clear this field to enable store and forward on the RX FIFO. When programming a value greater than 0 (cut-through operation), it must be greater than RAEM[RX_ALMOST_EMPTY].


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_RSEM register.
//
//*****************************************************************************

#define RX_SECTION_EMPTY              0x00007F80      // Value, in 64-bit words, of the receive FIFO section empty threshold. When the FIFO level reaches the value programmed in this field, a pause frame will be issued.


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_RAEM register.
//
//*****************************************************************************

#define RX_ALMOST_EMPTY               0x00007F80      // Value, in 64-bit words, of the receive FIFO almost empty threshold. When the FIFO level reaches the value programmed in this field and the end-of-frame has not been received for the frame yet, the core receive read control stops FIFO read (and subsequently stops transferring data to the MAC client application).


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_RAFL register.
//
//*****************************************************************************

#define RX_ALMOST_FULL                0x00007F80      // Value, in 64-bit words, of the receive FIFO almost full threshold. When the FIFO level comes close to the maximum, so that there is no more space for at least RX_ALMOST_FULL number of words, the MAC stops writing data in the FIFO and truncates the received frame to avoid FIFO overflow.


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_TSEM register.
//
//*****************************************************************************

#define TX_SECTION_EMPTY              0x00007F80      // Value, in 64-bit words, of the transmit FIFO section empty threshold. See Transmit FIFO for more information.


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_TAEM register.
//
//*****************************************************************************

#define TX_ALMOST_EMPTY               0x00007F80      // Value, in 64-bit words, of the transmit FIFO almost empty threshold. When the FIFO level reaches the value programmed in this field and the end-of-frame is not available for the frame yet, the MAC transmit logic, to avoid FIFO underflow, stops reading the FIFO and transmits a frame with an MII error indication.


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_TAFL register.
//
//*****************************************************************************

#define TX_ALMOST_FULL                0x00007F80      // Value, in 64-bit words, of the transmit FIFO almost full threshold. A minimum value of six is required. A recommended value of at least 8 should be set allowing a latency of two clock cycles to the application. If more latency is required the value can be increased as necessary (latency = TAFL - 5).


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_TIPG register.
//
//*****************************************************************************

